app/controllers/articulos_controller.rb

  def index
  	@articulos=Articulo.all.order("created_at DESC").paginate(page: params[:page], :per_page=>2)
---
SELECT  "articulos".* FROM "articulos"  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articulos"

  def create

  	@articulo=current_autor.articulos.build(articulo_params)

		if @articulo.save
---
INSERT INTO "articulos" ("titulo", "contenido", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "Artículo 1"], ["contenido", "Lorem Ipsum dolorem"], ["created_at", "2016-04-16 18:45:11.243868"], ["updated_at", "2016-04-16 18:45:11.243868"]]

	def edit
		@boton="Modificar"
		@articulo=Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 3]]

	def update
		@articulo=Articulo.find(params[:id])
		if @articulo.update(articulo_params)
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "articulos" SET "titulo" = ?, "contenido" = ?, "updated_at" = ? WHERE "articulos"."id" = ?  [["titulo", "Artículo 3 Nuevo"], ["contenido", "Soy el artículo tres y voy  ser más largo para validar correctamente"], ["updated_at", "2016-04-18 16:19:04.566124"], ["id", 3]]

	def show
		@articulo=Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 4]]

	def destroy
		@articulo=Articulo.find(params[:id])
		@articulo.destroy
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 3]]