app/controllers/comentarios_controller.rb

INSERT INTO "comentarios" ("nombre", "texto", "articulo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "sonia"], ["texto", "comentario 1"], ["articulo_id", 5], ["created_at", "2016-04-20 14:34:58.780282"], ["updated_at", "2016-04-20 14:34:58.780282"]]
---
  def create
    @comentario = @articulo.comentarios.create(comentario_params)

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = ? AND "comentarios"."id" = ? LIMIT 1  [["articulo_id", 6], ["id", 7]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = ?  [["id", 7]]
---
  def destroy
    @comentario = @articulo.comentarios.find(params[:id])
    @comentario.destroy

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 7]]
---
      def set_articulo
        @articulo = Articulo.find(params[:articulo_id])